src/Catalogs/кфкПродюсеры/кфкПродюсеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкПродюсеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.кфкБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАсинх</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьРегистрацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьСериализацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодпотокиОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодпотокиТранспорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПакетнуюПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыМетаданных</name>
    <attributes>
      <name>ТипОбъект</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>430</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТопика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСериализации</name>
      <type>
        <types>EnumRef.кфкТипыОбработчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМетодаСериализации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМодуляСериализации</name>
      <comment>Менеджер обмена (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПОДСериализации</name>
      <comment>Имя ПОД (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФорматСериализации</name>
      <comment>Формат (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПродюсера</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/кфкТипыОбработчиков/кфкТипыОбработчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкТипыОбработчиков</name>
  <enumValues>
    <name>ПроизвольныйОбработчик</name>
  </enumValues>
  <enumValues>
    <name>КонвертацияДанных</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/кфкПродюсеры/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИнициализированныеПравилаОбмена;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// инициализация нового
	Если Объект.Ссылка.Пустая() И Не Объект.РежимАсинх Тогда
		Ключи = ОбщегоНазначения.ВыгрузитьКолонку(Объект.ПараметрыПродюсера, "Ключ");
		Для Каждого ПараметрОтправки Из СтандартныеПараметрыКонсьюмера() Цикл
			Если Ключи.Найти(ПараметрОтправки.Ключ) = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Объект.ПараметрыПродюсера.Добавить(), ПараметрОтправки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// инициализация параметров
	СвойстваLibrdKafka = кфкИнтеграцияСлужебныйПовтИсп.СвойстваLibrdKafka("P");
	ЗаполнитьЗначенияПредставления();
	
	// инициализация КД
	УстановитьУсловноеОформление();
	СписокВыбора = Элементы.ОбъектыМетаданныхФорматСериализации.СписокВыбора;
	Для Каждого ПакетXDTO Из Метаданные.ПакетыXDTO Цикл
		СписокВыбора.Добавить(ПакетXDTO.ПространствоИмен);
	КонецЦикла;
	ИменаОбщихМодулей = Новый Массив(кфкИнтеграцияСлужебныйПовтИсп.ПолучитьИменаОбщихМодулей());
	Элементы.ОбъектыМетаданныхИмяМодуляСериализации.СписокВыбора.ЗагрузитьЗначения(ИменаОбщихМодулей);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
	УстановитьВидимостьСериализации();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьЗначенияПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимАсинхПриИзменении(Элемент)
	
	ПараметрыОтправки = СтандартныеПараметрыКонсьюмера();
	
	Ключи = КлючиПараметровПродюсера();
	Для Каждого ПараметрОтправки Из ПараметрыОтправки Цикл
		Если Объект.РежимАсинх Тогда
			ВерхнаяяГраница = Объект.ПараметрыПродюсера.Количество() - 1;
			Для Итератор = 0 по ВерхнаяяГраница Цикл
				Если ПараметрыОтправки.Получить(Объект.ПараметрыПродюсера[ВерхнаяяГраница - Итератор].Ключ) <> Неопределено Тогда
					Объект.ПараметрыПродюсера.Удалить(ВерхнаяяГраница - Итератор);
				КонецЕсли;
			КонецЦикла;
		
		Иначе
			Если Ключи.Найти(ПараметрОтправки.Ключ) = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Объект.ПараметрыПродюсера.Добавить(), ПараметрОтправки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыМетаданных

&НаКлиенте
Процедура ОбъектыМетаданныхПриАктивизацииСтроки(Элемент)
	
	ИнициализироватьПравилаОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если Копирование Тогда
		
		Отказ = Истина;
		
		НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.ТекущиеДанные, , "НомерСтроки,ТипОбъект,ИмяТопика,ИмяПОДСериализации"); // ИмяМетодаСериализации
		
		Элементы.ОбъектыМетаданных.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элементы.ОбъектыМетаданных.ТекущийЭлемент = Элементы.ОбъектыМетаданныхТипОбъект;
		Элементы.ОбъектыМетаданных.ИзменитьСтроку();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхТипОбъектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.кфкПродюсеры.Форма.ФормаВыбораОбъектаМетаданных", , ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗавершитьВыбораОбъектаМетаданных", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхТипСериализацииПриИзменении(Элемент)
	
	УстановитьВидимостьСериализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхИмяМетодаСериализацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОбъектыМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.кфкПродюсеры.Форма.ФормаВводаОбработчика",
		Новый Структура("ИмяМетода", Элемент.ТекстРедактирования), ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗавершитьВводаОбработчика", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхИмяМодуляСериализацииПриИзменении(Элемент)
	
	ИнициализироватьПравилаОбмена();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыПродюсера

&НаКлиенте
Процедура ПараметрыПродюсераПриАктивизацииСтроки(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование,
		Родитель, ЭтоГруппа, Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераКлючПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераКлючНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора,
		ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераКлючАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияКлючАвтоПодбор(ЭтотОбъект, Элемент, Текст, ДанныеВыбора,
		ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПродюсераЗначениеПредставлениеПриИзменении(Элемент)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПараметрыПродюсераЗначениеПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	кфкИнтеграцияСлужебныйКлиент.ПараметрыПодключенияЗначениеПредставлениеНачалоВыбора(ЭтотОбъект, Элемент,
		ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьСериализацию(Команда)
	
	ОчиститьСообщения();
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Продюсер был изменен. Для начала сериализации сообщений сохраните настройки.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗапускДоступен() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучногоЗадания();
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьСериализациюНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершитьПоток", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПубликацию(Команда)
	
	ОчиститьСообщения();
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Продюсер был изменен. Для начала публикации сообщений сохраните настройки.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗапускДоступен() Тогда
		//@skip-check new-font
		кфкИнтеграцияСлужебныйКлиент.СообщениеНедоступностиРучногоЗадания();
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьПубликациюНаСервере(Объект.Ссылка, УникальныйИдентификатор);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершитьПоток", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеПараметрыПродюсера(Команда)
	
	Объект.ПараметрыПродюсера.Очистить();
	
	Для Каждого Параметр Из СтандартныеПараметрыКонсьюмера() Цикл
		НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
		НоваяСтрока.ЗначениеПредставление = Параметр.Значение;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#Область Блокировка

&НаКлиенте
Процедура БлокироватьРегистрацию(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьРегистрацию = Не Объект.БлокироватьРегистрацию;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура БлокироватьСериализацию(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьСериализацию = Не Объект.БлокироватьСериализацию;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура БлокироватьПубликацию(Команда)
	
	Модифицированность = Истина;
	
	Объект.БлокироватьПубликацию = Не Объект.БлокироватьПубликацию;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ФормаГруппаБлокировка.Доступность = Не Объект.Ссылка.Пустая();
	Элементы.ФормаБлокироватьРегистрацию.Пометка = Объект.БлокироватьРегистрацию;
	Элементы.ФормаБлокироватьСериализацию.Пометка = Объект.БлокироватьСериализацию;
	Элементы.ФормаБлокироватьПубликацию.Пометка = Объект.БлокироватьПубликацию;
	
	Элементы.ДекорацияБлокироватьРегистрацию.Видимость = Объект.БлокироватьРегистрацию;
	Элементы.ДекорацияБлокироватьСериализацию.Видимость = Объект.БлокироватьСериализацию;
	Элементы.ДекорацияБлокироватьПубликацию.Видимость = Объект.БлокироватьПубликацию;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСериализации()
	
	// ПроизвольныйОбработчик
	ТипСериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.ПроизвольныйОбработчик");
	Строки = Объект.ОбъектыМетаданных.НайтиСтроки(Новый Структура("ТипСериализации", ТипСериализации));
	Элементы.ОбъектыМетаданныхИмяМетодаСериализации.Видимость = Строки.Количество() > 0;
	
	// КонвертацияДанных
	ТипСериализации = ПредопределенноеЗначение("Перечисление.кфкТипыОбработчиков.КонвертацияДанных");
	Строки = Объект.ОбъектыМетаданных.НайтиСтроки(Новый Структура("ТипСериализации", ТипСериализации));
	Элементы.ОбъектыМетаданныхГруппаСериализацияКД.Видимость = Строки.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПоток(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда // TODO: ИнформацияОбОшибке с БСП 3.1.10
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить проверку подключения к брокеру.'"));
		КонецЕсли;
		
		Возврат;
		 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыбораОбъектаМетаданных(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ОбъектыМетаданных.ТекущиеДанные;
	
	Строки = Объект.ОбъектыМетаданных.НайтиСтроки(Новый Структура("ТипОбъект", РезультатЗакрытия));
	Для Каждого Строка Из Строки Цикл
		//@skip-check bsl-legacy-check-dynamic-feature-access
		Если ТекущиеДанные.НомерСтроки <> Строка.НомерСтроки Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ТекущиеДанные.ТипОбъект = РезультатЗакрытия;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводаОбработчика(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ОбъектыМетаданных.ТекущиеДанные;
	ТекущиеДанные.ИмяМетодаСериализации = РезультатЗакрытия;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция КлючиПараметровПродюсера()
	
	Результат = Новый Массив;
	Для Каждого ПараметрОтправки Из Объект.ПараметрыПродюсера Цикл
		Результат.Добавить(ПараметрОтправки.Ключ);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьПравилаОбмена()
	
	ТекущиеДанные = Элементы.ОбъектыМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
			Или ПустаяСтрока(ТекущиеДанные.ИмяМодуляСериализации)
			Или ТекущиеДанные.ИмяМодуляСериализации = ИнициализированныеПравилаОбмена Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализированныеПравилаОбмена = ТекущиеДанные.ИмяМодуляСериализации;
	
	СписокВыбора = Элементы.ОбъектыМетаданныхИмяПОДСериализации.СписокВыбора;
	СписокВыбора.Очистить();
	
	ПОДы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПравилаОбработкиДанных, ИнициализированныеПравилаОбмена);
	Если ПОДы = Неопределено Тогда
		
		ПОДы = ДоступныеПОДы(ИнициализированныеПравилаОбмена);
		
		Правила = ?(ПравилаОбработкиДанных = Неопределено, Новый Структура, Новый Структура(ПравилаОбработкиДанных));
		Правила.Вставить(ИнициализированныеПравилаОбмена, ПОДы);
		ПравилаОбработкиДанных = Новый ФиксированнаяСтруктура(Правила);
		
	КонецЕсли;
	
	СписокВыбора.ЗагрузитьЗначения(ПОДы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтандартныеПараметрыКонсьюмера()
	
//	см. Обработка.кфкИнтеграция.ОтправитьСообщение()
	
	Результат = Новый Соответствие;
	Результат.Вставить("message.timeout.ms", 5000); // с этим параметром поакуратнее	
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапускДоступен()
	Возврат Не ПолучитьФункциональнуюОпцию("кфкБлокировкаИнтеграции");
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьСериализациюНаСервере(Продюсер, Идентификатор)
	Возврат кфкФоновыеОперацииСлужебный.ЗапуститьПотокИнтерактивно(Продюсер, Истина, Идентификатор);
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьПубликациюНаСервере(Продюсер, Идентификатор)
	Возврат кфкФоновыеОперацииСлужебный.ЗапуститьПотокИнтерактивно(Продюсер, Ложь, Идентификатор);
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеПОДы(МенеджерОбмена)
	
	КомпонентыОбмена = кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Отправка");
	КомпонентыОбмена.МенеджерОбмена = ОбщегоНазначения.ОбщийМодуль(МенеджерОбмена);
	ПОДы = кфкОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных(КомпонентыОбмена);
	
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(ПОДы, "Имя");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗначенияПредставления()
	
	Для Каждого Строка Из Объект.ПараметрыПродюсера Цикл // ТекущийОбъект
		
		Свойство = СвойстваLibrdKafka.Получить(Строка.Ключ); // см. кфкИнтеграцияСлужебный.НовоеОписаниеСвойстваLibrdKafka
		ТипЗначения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойство, "ТипЗначения");
		Строка.ЗначениеПредставление = ?(ТипЗначения = "int" Или ТипЗначения = "float",
			СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.Значение), Строка.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// ПроизвольныйОбработчик
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыМетаданныхИмяМетодаСериализации.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОбъектыМетаданных.ТипСериализации");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	
	// ПроизвольныйОбработчик
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыМетаданныхФорматСериализации.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыМетаданныхИмяМодуляСериализации.Имя);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъектыМетаданныхИмяПОДСериализации.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОбъектыМетаданных.ТипСериализации");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.кфкТипыОбработчиков.КонвертацияДанных;
	
КонецПроцедуры

#КонецОбласти
